{"pages":[{"title":"Home","text":"","link":"/Home/index.html"},{"title":"about","text":"","link":"/about/index.html"},{"title":"all-tags","text":"","link":"/all-tags/index.html"},{"title":"all-categories","text":"","link":"/all-categories/index.html"}],"posts":[{"title":"Mac OS에서 JAVA Setup 하기","text":"개발환경운영체제: Mac OS Catalina (Version 10.15.7) 터미널 프로필: zshrc 1. JAVA 설치JDK 11출처: https://llighter.github.io/install-java-on-mac/ 1-1. HomebrewJDK 11은 Homebrew로 설치할 것이므로 버전이 최신인지 확인하고 업데이트 (+ 필요시 업그레이드) 해준다.1brew update 1brew upgrade Open JDK를 조회할 수 있도록 추가한다.1brew tap adoptopenjdk/openjdk Oracle JDK와 OpenJDK의 차이점 Oracle JDK는 상용(유료)이지만, OpenJDK는 오픈소스기반(무료)입니다. Oracle JDK의 라이선스는 Oracle BCL(Binary Code License) Agreement이지만, OpenJDK의 라이선스는 Oracle GPL v2입니다. Oracle JDK는 LTS(장기 지원) 업데이트 지원을 받을 수 있지만, OpenJDK는 LTS 없이 6개월마다 새로운 버전이 배포됩니다. Oracle JDK는 Oracle이 인수한 Sun Microsystems 플러그인을 제공하지만, OpenJDK는 제공하지 않습니다. Oracle JDK는 OpenJDK 보다 CPU 사용량과 메모리 사용량이 적고, 응답시간이 높습니다. 출처 : https://lindarex.github.io/concepts/difference-between-oraclejdk-openjdk 설치 가능한 JDK 찾기1brew search jdk 123456789101112131415161718192021222324// 2021.7 현재 조회되는 Open JDK ~/ brew search jdk==&gt; Formulaeopenjdk ✔ openjdk@11 openjdk@8 jd mdk cdk==&gt; Casksadoptopenjdk adoptopenjdk12-openj9-large adoptopenjdk15-openj9-largeadoptopenjdk-jre adoptopenjdk13 adoptopenjdk16adoptopenjdk-openj9 adoptopenjdk13-jre adoptopenjdk16-jreadoptopenjdk-openj9-jre adoptopenjdk13-openj9 adoptopenjdk16-openj9adoptopenjdk-openj9-jre-large adoptopenjdk13-openj9-jre adoptopenjdk16-openj9-jreadoptopenjdk-openj9-large adoptopenjdk13-openj9-jre-large adoptopenjdk8adoptopenjdk10 adoptopenjdk13-openj9-large adoptopenjdk8-jreadoptopenjdk11 ✔ adoptopenjdk14 adoptopenjdk8-openj9adoptopenjdk11-jre adoptopenjdk14-jre adoptopenjdk8-openj9-jreadoptopenjdk11-openj9 adoptopenjdk14-openj9 adoptopenjdk8-openj9-jre-largeadoptopenjdk11-openj9-jre adoptopenjdk14-openj9-jre adoptopenjdk8-openj9-largeadoptopenjdk11-openj9-jre-large adoptopenjdk14-openj9-jre-large adoptopenjdk9adoptopenjdk11-openj9-large adoptopenjdk14-openj9-large jdk-mission-controladoptopenjdk12 adoptopenjdk15 microsoft-openjdkadoptopenjdk12-jre adoptopenjdk15-jre oracle-jdkadoptopenjdk12-openj9 adoptopenjdk15-openj9 oracle-jdk-javadocadoptopenjdk12-openj9-jre adoptopenjdk15-openj9-jre sapmachine-jdkadoptopenjdk12-openj9-jre-large adoptopenjdk15-openj9-jre-large 설치1brew install --cask adoptopenjdk11 자바가 설치된 경로 확인1/usr/libexec/java_home -V 123456// example ~/ /usr/libexec/java_home -VMatching Java Virtual Machines (2): 11.0.11, x86_64: &quot;AdoptOpenJDK 11&quot; /Library/Java/JavaVirtualMachines/adoptopenjdk-11.jdk/Contents/Home 자바 버전 확인하기12java -version (JDK 8)java --version (JDK 11) 2. JAVA 버전 관리이 포스트의 핵심이 되는 버전 관리에 대한 내용이다.1 ~/ code . VScode를 주로 쓰기에 최상위폴더에서 VScode를 열어 .zshrc 파일을 수정한다. 맨 하단(선택)에 이 코드를 붙여넣기 한다.123456789# Java Pathsexport JAVA_HOME_8=$(/usr/libexec/java_home -v 1.8)# export JAVA_HOME_8=/Library/Java/JavaVirtualMachines/adoptopenjdk-8.jdk/Contents/Homeexport JAVA_HOME_11=$(/usr/libexec/java_home -v 11)# Java 8export JAVA_HOME=$JAVA_HOME_8# Java 11# 11버전을 사용하고자 하는 경우 아래 주석(#)을 해제하고 위에 8버전을 주석처리 하면된다.# export JAVA_HOME=$JAVA_HOME_11 ♦️ 주의: JDK8은 버전 v-8이 아닌 v- 1.8이다.변경된 프로필을 적용해준다.1source ~/.zshrc 끝","link":"/2021/07/07/Mac-OS%EC%97%90%EC%84%9C-JAVA-Setup-%ED%95%98%EA%B8%B0/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/06/24/hello-world/"}],"tags":[],"categories":[{"name":"java","slug":"java","link":"/categories/java/"}]}